#include "task-43-phonebook.h"

// Написать программу - телефонный справочник.
// Она должна уметь хранить имена и номера телефонов,
// в интерактивном режиме осуществлять следующие операции:

// 0 - выйти
// 1 - добавить запись (имя и телефон)
// 2 - распечатать все имеющиеся записи
// 3 - найти телефон по имени
// 4 - найти имя по телефону
// 5 - сохранить текущие данные в файл

// При запуске программа должна читать данные из файла,
// если файла нет - начинать с пустой базы номеров.
// Размер базы ограничен сотней записей.

void phoneBookHandler()
{
	// nothing here yet :(
}
